      * ARQUIVO DE IMPORTACAO DE CLIENTES
       FD  ARQ-IMPORTACAO
           LABEL RECORD IS STANDARD
           VALUE OF FILE-STATUS IS WID-ARQ-IMPORTACAO.
      *
       01  ARQ-REGISTRO-CLIENTE.
           03 ARQ-CD-CLIENTE         PIC  9(007).
           03 ARQ-NR-CNPJ-CLIENTE    PIC  9(014).
           03 ARQ-DS-RAZAO-SOCIAL    PIC  X(040).
           03 ARQ-NR-LATITUDE        PIC S9(003)V9(008).
           03 ARQ-NR-LONGITUDE       PIC S9(003)V9(008).
      *