      * ARQUIVO DE IMPORTACAO DE VENDEDOR
       FD  ARQ-IMPORTACAO
           LABEL RECORD IS STANDARD
           VALUE OF FILE-STATUS IS WID-ARQ-IMPORTACAO.
      *
       01  ARQ-REGISTRO-VENDEDOR.
           03 ARQ-CD-VENDEDOR        PIC  9(007).
           03 ARQ-NR-CPF-VENDEDOR    PIC  9(011).
           03 ARQ-NM-VENDEDOR        PIC  X(040).
           03 ARQ-NR-LATITUDE        PIC S9(003)V9(008).
           03 ARQ-NR-LONGITUDE       PIC S9(003)V9(008).
      *
